import { LINK_myHabrArticles } from "@/constants/links";
import { TYPE_HTML, TYPE_semanticHTML } from "@/constants/types";

export default {
	title: "Привет, меня зовут Влад!",
	content: [
		{
			subtitle: "Кто я такой1?",
			paragraph: [
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Я занимаюсь больше года веб-разработкой, делаю сайты. Являюсь junior+/middle разработчиком, зависит от того, кто для вас junior+, а кто middle :) Мне это очень нравится, хочу развиваться в этом направлении дальше и глубже. Написал даже статью на хабре: ",
						},
						{
							type: TYPE_HTML.LINK,
							value: LINK_myHabrArticles[0],
						},
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: ". Пользовательские интерфейсы, UI-компоненты, запросы на сервер, работа с данными в БД, проектирование БД, работа с бизнес-логикой, рефакторинг кода(работал и с легаси тоже)",
						},
					],
				},
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Нравится фуллстек, проектирование системы от начала и до конца. Стараюсь придерживаться единого стиля проекта, чтобы можно было удобно расширять не только горизонтально, но и вертикально.",
						},
					],
				},
			],
		},
		{
			subtitle: "Кто я такой2?",
			paragraph: [
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Я занимаюсь больше года веб-разработкой, делаю сайты. Являюсь junior+/middle разработчиком, зависит от того, кто для вас junior+, а кто middle :) Мне это очень нравится, хочу развиваться в этом направлении дальше и глубже. Написал даже статью на хабре: ",
						},
						{
							type: TYPE_HTML.LINK,
							value: LINK_myHabrArticles[0],
						},
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: ". Пользовательские интерфейсы, UI-компоненты, запросы на сервер, работа с данными в БД, проектирование БД, работа с бизнес-логикой, рефакторинг кода(работал и с легаси тоже)",
						},
					],
				},
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Нравится фуллстек, проектирование системы от начала и до конца. Стараюсь придерживаться единого стиля проекта, чтобы можно было удобно расширять не только горизонтально, но и вертикально.",
						},
					],
				},
			],
		},
		{
			subtitle: "Кто я такой3?",
			paragraph: [
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Я занимаюсь больше года веб-разработкой, делаю сайты. Являюсь junior+/middle разработчиком, зависит от того, кто для вас junior+, а кто middle :) Мне это очень нравится, хочу развиваться в этом направлении дальше и глубже. Написал даже статью на хабре: ",
						},
						{
							type: TYPE_HTML.LINK,
							value: LINK_myHabrArticles[0],
						},
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: ". Пользовательские интерфейсы, UI-компоненты, запросы на сервер, работа с данными в БД, проектирование БД, работа с бизнес-логикой, рефакторинг кода(работал и с легаси тоже)",
						},
					],
				},
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Нравится фуллстек, проектирование системы от начала и до конца. Стараюсь придерживаться единого стиля проекта, чтобы можно было удобно расширять не только горизонтально, но и вертикально.",
						},
					],
				},
			],
		},
		{
			subtitle: "Кто я такой4?",
			paragraph: [
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Я занимаюсь больше года веб-разработкой, делаю сайты. Являюсь junior+/middle разработчиком, зависит от того, кто для вас junior+, а кто middle :) Мне это очень нравится, хочу развиваться в этом направлении дальше и глубже. Написал даже статью на хабре: ",
						},
						{
							type: TYPE_HTML.LINK,
							value: LINK_myHabrArticles[0],
						},
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: ". Пользовательские интерфейсы, UI-компоненты, запросы на сервер, работа с данными в БД, проектирование БД, работа с бизнес-логикой, рефакторинг кода(работал и с легаси тоже)",
						},
					],
				},
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Нравится фуллстек, проектирование системы от начала и до конца. Стараюсь придерживаться единого стиля проекта, чтобы можно было удобно расширять не только горизонтально, но и вертикально.",
						},
					],
				},
			],
		},
		{
			subtitle: "Кто я такой5?",
			paragraph: [
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Я занимаюсь больше года веб-разработкой, делаю сайты. Являюсь junior+/middle разработчиком, зависит от того, кто для вас junior+, а кто middle :) Мне это очень нравится, хочу развиваться в этом направлении дальше и глубже. Написал даже статью на хабре: ",
						},
						{
							type: TYPE_HTML.LINK,
							value: LINK_myHabrArticles[0],
						},
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: ". Пользовательские интерфейсы, UI-компоненты, запросы на сервер, работа с данными в БД, проектирование БД, работа с бизнес-логикой, рефакторинг кода(работал и с легаси тоже)",
						},
					],
				},
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Нравится фуллстек, проектирование системы от начала и до конца. Стараюсь придерживаться единого стиля проекта, чтобы можно было удобно расширять не только горизонтально, но и вертикально.",
						},
					],
				},
			],
		},
		{
			subtitle: "Кто я такой6?",
			paragraph: [
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Я занимаюсь больше года веб-разработкой, делаю сайты. Являюсь junior+/middle разработчиком, зависит от того, кто для вас junior+, а кто middle :) Мне это очень нравится, хочу развиваться в этом направлении дальше и глубже. Написал даже статью на хабре: ",
						},
						{
							type: TYPE_HTML.LINK,
							value: LINK_myHabrArticles[0],
						},
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: ". Пользовательские интерфейсы, UI-компоненты, запросы на сервер, работа с данными в БД, проектирование БД, работа с бизнес-логикой, рефакторинг кода(работал и с легаси тоже)",
						},
					],
				},
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Нравится фуллстек, проектирование системы от начала и до конца. Стараюсь придерживаться единого стиля проекта, чтобы можно было удобно расширять не только горизонтально, но и вертикально.",
						},
					],
				},
			],
		},
		{
			subtitle: "Кто я такой7?",
			paragraph: [
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Я занимаюсь больше года веб-разработкой, делаю сайты. Являюсь junior+/middle разработчиком, зависит от того, кто для вас junior+, а кто middle :) Мне это очень нравится, хочу развиваться в этом направлении дальше и глубже. Написал даже статью на хабре: ",
						},
						{
							type: TYPE_HTML.LINK,
							value: LINK_myHabrArticles[0],
						},
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: ". Пользовательские интерфейсы, UI-компоненты, запросы на сервер, работа с данными в БД, проектирование БД, работа с бизнес-логикой, рефакторинг кода(работал и с легаси тоже)",
						},
					],
				},
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Нравится фуллстек, проектирование системы от начала и до конца. Стараюсь придерживаться единого стиля проекта, чтобы можно было удобно расширять не только горизонтально, но и вертикально.",
						},
					],
				},
			],
		},
		{
			subtitle: "Кто я такой8?",
			paragraph: [
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Я занимаюсь больше года веб-разработкой, делаю сайты. Являюсь junior+/middle разработчиком, зависит от того, кто для вас junior+, а кто middle :) Мне это очень нравится, хочу развиваться в этом направлении дальше и глубже. Написал даже статью на хабре: ",
						},
						{
							type: TYPE_HTML.LINK,
							value: LINK_myHabrArticles[0],
						},
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: ". Пользовательские интерфейсы, UI-компоненты, запросы на сервер, работа с данными в БД, проектирование БД, работа с бизнес-логикой, рефакторинг кода(работал и с легаси тоже)",
						},
					],
				},
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Нравится фуллстек, проектирование системы от начала и до конца. Стараюсь придерживаться единого стиля проекта, чтобы можно было удобно расширять не только горизонтально, но и вертикально.",
						},
					],
				},
			],
		},
		{
			subtitle: "Кто я такой9?",
			paragraph: [
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Я занимаюсь больше года веб-разработкой, делаю сайты. Являюсь junior+/middle разработчиком, зависит от того, кто для вас junior+, а кто middle :) Мне это очень нравится, хочу развиваться в этом направлении дальше и глубже. Написал даже статью на хабре: ",
						},
						{
							type: TYPE_HTML.LINK,
							value: LINK_myHabrArticles[0],
						},
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: ". Пользовательские интерфейсы, UI-компоненты, запросы на сервер, работа с данными в БД, проектирование БД, работа с бизнес-логикой, рефакторинг кода(работал и с легаси тоже)",
						},
					],
				},
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Нравится фуллстек, проектирование системы от начала и до конца. Стараюсь придерживаться единого стиля проекта, чтобы можно было удобно расширять не только горизонтально, но и вертикально.",
						},
					],
				},
			],
		},
		{
			subtitle: "Кто я такой10?",
			paragraph: [
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Я занимаюсь больше года веб-разработкой, делаю сайты. Являюсь junior+/middle разработчиком, зависит от того, кто для вас junior+, а кто middle :) Мне это очень нравится, хочу развиваться в этом направлении дальше и глубже. Написал даже статью на хабре: ",
						},
						{
							type: TYPE_HTML.LINK,
							value: LINK_myHabrArticles[0],
						},
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: ". Пользовательские интерфейсы, UI-компоненты, запросы на сервер, работа с данными в БД, проектирование БД, работа с бизнес-логикой, рефакторинг кода(работал и с легаси тоже)",
						},
					],
				},
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Нравится фуллстек, проектирование системы от начала и до конца. Стараюсь придерживаться единого стиля проекта, чтобы можно было удобно расширять не только горизонтально, но и вертикально.",
						},
					],
				},
			],
		},
		{
			subtitle: "Кто я такой11?",
			paragraph: [
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Я занимаюсь больше года веб-разработкой, делаю сайты. Являюсь junior+/middle разработчиком, зависит от того, кто для вас junior+, а кто middle :) Мне это очень нравится, хочу развиваться в этом направлении дальше и глубже. Написал даже статью на хабре: ",
						},
						{
							type: TYPE_HTML.LINK,
							value: LINK_myHabrArticles[0],
						},
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: ". Пользовательские интерфейсы, UI-компоненты, запросы на сервер, работа с данными в БД, проектирование БД, работа с бизнес-логикой, рефакторинг кода(работал и с легаси тоже)",
						},
					],
				},
				{
					type: TYPE_semanticHTML.TEXT,
					value: [
						{
							type: TYPE_HTML.TEXT_PLAIN,
							value: "Нравится фуллстек, проектирование системы от начала и до конца. Стараюсь придерживаться единого стиля проекта, чтобы можно было удобно расширять не только горизонтально, но и вертикально.",
						},
					],
				},
			],
		},
	],
};
